# LoadCell

## Description
Procedure LoadCell inserts a value into a specified cell of the active worksheet.

```pascal
PROCEDURE LoadCell(
				row   : INTEGER;
				col   : INTEGER;
				entry : STRING);
```

```python
def vs.LoadCell(ro, col, entry):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|row|INTEGER|Worksheet row index.|
|col|INTEGER|Worksheet column index.|
|entry|STRING|Worksheet entry value.|

## Examples
#### VectorScript ####
```pascal
SprdSheet(0, 0, 3, 3);
LoadCell(1, 1, '= (14 + 2) * 3');
{ inserts a formula into a cell }

SprdSheet(0, 0, 3, 3);
LoadCell(1, 1, 'Window Schedule');
{ inserts a literal into a cell }
```
#### Python ####
```python

```

```pascal
			SetWSCellFormula(WSHand,CurrentRow,15,CurrentRow,15,Concat(gPanDeg[SceneCount, LightCount]));
			SetWSCellFormula(WSHand,CurrentRow,16,CurrentRow,16,Concat(gTiltDeg[SceneCount, LightCount]));
			SetWSCellFormula(WSHand,CurrentRow,17,CurrentRow,17,Concat(gDistFallOff[SceneCount, LightCount]));
			SetWSCellFormula(WSHand,CurrentRow,18,CurrentRow,18,Concat(gAngFallOff[SceneCount, LightCount]));
			LoadCell(CurrentRow, 18, Concat(gAngFallOff[SceneCount, LightCount]));
		END; {LightCount}
END; {NumLights > 0}
```
```python
vs.LoadCell(ro, col, entry)
```

## See Also
VS functions:
* SetWSCellFormula (string, obsolete from VW 2012)
* SetWSCellFormulaN (Dynarray of Char)

## Version
LoadCell is obsolete as of VectorWorks 9.0, see new  SetWSCellFormula (string),   SetWSCellFormulaN (Dynarray of Char).

Availability: from All Versions

## Category
* Worksheets